koyoi/hal_ard_2_stm32/arduino_pin_defs.h
#ifndef ARDUINO_PIN_DEFS_H
#define ARDUINO_PIN_DEFS_H

#define STM_PIN_ENCODE(port, pin) (((port) << 8) | ((pin) & 0xFF))

#define STM_PORT_A 0
#define STM_PORT_B 1
#define STM_PORT_C 2
#define STM_PORT_D 3
#define STM_PORT_E 4
#define STM_PORT_F 5
#define STM_PORT_G 6
#define STM_PORT_H 7
#define STM_PORT_I 8
#define STM_PORT_J 9
#define STM_PORT_K 10

/* Port A */
#define PA0 STM_PIN_ENCODE(STM_PORT_A, 0)
#define PA1 STM_PIN_ENCODE(STM_PORT_A, 1)
#define PA2 STM_PIN_ENCODE(STM_PORT_A, 2)
#define PA3 STM_PIN_ENCODE(STM_PORT_A, 3)
#define PA4 STM_PIN_ENCODE(STM_PORT_A, 4)
#define PA5 STM_PIN_ENCODE(STM_PORT_A, 5)
#define PA6 STM_PIN_ENCODE(STM_PORT_A, 6)
#define PA7 STM_PIN_ENCODE(STM_PORT_A, 7)
#define PA8 STM_PIN_ENCODE(STM_PORT_A, 8)
#define PA9 STM_PIN_ENCODE(STM_PORT_A, 9)
#define PA10 STM_PIN_ENCODE(STM_PORT_A, 10)
#define PA11 STM_PIN_ENCODE(STM_PORT_A, 11)
#define PA12 STM_PIN_ENCODE(STM_PORT_A, 12)
#define PA13 STM_PIN_ENCODE(STM_PORT_A, 13)
#define PA14 STM_PIN_ENCODE(STM_PORT_A, 14)
#define PA15 STM_PIN_ENCODE(STM_PORT_A, 15)

/* Port B */
#define PB0 STM_PIN_ENCODE(STM_PORT_B, 0)
#define PB1 STM_PIN_ENCODE(STM_PORT_B, 1)
#define PB2 STM_PIN_ENCODE(STM_PORT_B, 2)
#define PB3 STM_PIN_ENCODE(STM_PORT_B, 3)
#define PB4 STM_PIN_ENCODE(STM_PORT_B, 4)
#define PB5 STM_PIN_ENCODE(STM_PORT_B, 5)
#define PB6 STM_PIN_ENCODE(STM_PORT_B, 6)
#define PB7 STM_PIN_ENCODE(STM_PORT_B, 7)
#define PB8 STM_PIN_ENCODE(STM_PORT_B, 8)
#define PB9 STM_PIN_ENCODE(STM_PORT_B, 9)
#define PB10 STM_PIN_ENCODE(STM_PORT_B, 10)
#define PB11 STM_PIN_ENCODE(STM_PORT_B, 11)
#define PB12 STM_PIN_ENCODE(STM_PORT_B, 12)
#define PB13 STM_PIN_ENCODE(STM_PORT_B, 13)
#define PB14 STM_PIN_ENCODE(STM_PORT_B, 14)
#define PB15 STM_PIN_ENCODE(STM_PORT_B, 15)

/* Port C */
#define PC0 STM_PIN_ENCODE(STM_PORT_C, 0)
#define PC1 STM_PIN_ENCODE(STM_PORT_C, 1)
#define PC2 STM_PIN_ENCODE(STM_PORT_C, 2)
#define PC3 STM_PIN_ENCODE(STM_PORT_C, 3)
#define PC4 STM_PIN_ENCODE(STM_PORT_C, 4)
#define PC5 STM_PIN_ENCODE(STM_PORT_C, 5)
#define PC6 STM_PIN_ENCODE(STM_PORT_C, 6)
#define PC7 STM_PIN_ENCODE(STM_PORT_C, 7)
#define PC8 STM_PIN_ENCODE(STM_PORT_C, 8)
#define PC9 STM_PIN_ENCODE(STM_PORT_C, 9)
#define PC10 STM_PIN_ENCODE(STM_PORT_C, 10)
#define PC11 STM_PIN_ENCODE(STM_PORT_C, 11)
#define PC12 STM_PIN_ENCODE(STM_PORT_C, 12)
#define PC13 STM_PIN_ENCODE(STM_PORT_C, 13)
#define PC14 STM_PIN_ENCODE(STM_PORT_C, 14)
#define PC15 STM_PIN_ENCODE(STM_PORT_C, 15)

/* Port D */
#define PD0 STM_PIN_ENCODE(STM_PORT_D, 0)
#define PD1 STM_PIN_ENCODE(STM_PORT_D, 1)
#define PD2 STM_PIN_ENCODE(STM_PORT_D, 2)
#define PD3 STM_PIN_ENCODE(STM_PORT_D, 3)
#define PD4 STM_PIN_ENCODE(STM_PORT_D, 4)
#define PD5 STM_PIN_ENCODE(STM_PORT_D, 5)
#define PD6 STM_PIN_ENCODE(STM_PORT_D, 6)
#define PD7 STM_PIN_ENCODE(STM_PORT_D, 7)
#define PD8 STM_PIN_ENCODE(STM_PORT_D, 8)
#define PD9 STM_PIN_ENCODE(STM_PORT_D, 9)
#define PD10 STM_PIN_ENCODE(STM_PORT_D, 10)
#define PD11 STM_PIN_ENCODE(STM_PORT_D, 11)
#define PD12 STM_PIN_ENCODE(STM_PORT_D, 12)
#define PD13 STM_PIN_ENCODE(STM_PORT_D, 13)
#define PD14 STM_PIN_ENCODE(STM_PORT_D, 14)
#define PD15 STM_PIN_ENCODE(STM_PORT_D, 15)

/* Port E */
#define PE0 STM_PIN_ENCODE(STM_PORT_E, 0)
#define PE1 STM_PIN_ENCODE(STM_PORT_E, 1)
#define PE2 STM_PIN_ENCODE(STM_PORT_E, 2)
#define PE3 STM_PIN_ENCODE(STM_PORT_E, 3)
#define PE4 STM_PIN_ENCODE(STM_PORT_E, 4)
#define PE5 STM_PIN_ENCODE(STM_PORT_E, 5)
#define PE6 STM_PIN_ENCODE(STM_PORT_E, 6)
#define PE7 STM_PIN_ENCODE(STM_PORT_E, 7)
#define PE8 STM_PIN_ENCODE(STM_PORT_E, 8)
#define PE9 STM_PIN_ENCODE(STM_PORT_E, 9)
#define PE10 STM_PIN_ENCODE(STM_PORT_E, 10)
#define PE11 STM_PIN_ENCODE(STM_PORT_E, 11)
#define PE12 STM_PIN_ENCODE(STM_PORT_E, 12)
#define PE13 STM_PIN_ENCODE(STM_PORT_E, 13)
#define PE14 STM_PIN_ENCODE(STM_PORT_E, 14)
#define PE15 STM_PIN_ENCODE(STM_PORT_E, 15)

/* Port F */
#define PF0 STM_PIN_ENCODE(STM_PORT_F, 0)
#define PF1 STM_PIN_ENCODE(STM_PORT_F, 1)
#define PF2 STM_PIN_ENCODE(STM_PORT_F, 2)
#define PF3 STM_PIN_ENCODE(STM_PORT_F, 3)
#define PF4 STM_PIN_ENCODE(STM_PORT_F, 4)
#define PF5 STM_PIN_ENCODE(STM_PORT_F, 5)
#define PF6 STM_PIN_ENCODE(STM_PORT_F, 6)
#define PF7 STM_PIN_ENCODE(STM_PORT_F, 7)
#define PF8 STM_PIN_ENCODE(STM_PORT_F, 8)
#define PF9 STM_PIN_ENCODE(STM_PORT_F, 9)
#define PF10 STM_PIN_ENCODE(STM_PORT_F, 10)
#define PF11 STM_PIN_ENCODE(STM_PORT_F, 11)
#define PF12 STM_PIN_ENCODE(STM_PORT_F, 12)
#define PF13 STM_PIN_ENCODE(STM_PORT_F, 13)
#define PF14 STM_PIN_ENCODE(STM_PORT_F, 14)
#define PF15 STM_PIN_ENCODE(STM_PORT_F, 15)

/* Port G */
#define PG0 STM_PIN_ENCODE(STM_PORT_G, 0)
#define PG1 STM_PIN_ENCODE(STM_PORT_G, 1)
#define PG2 STM_PIN_ENCODE(STM_PORT_G, 2)
#define PG3 STM_PIN_ENCODE(STM_PORT_G, 3)
#define PG4 STM_PIN_ENCODE(STM_PORT_G, 4)
#define PG5 STM_PIN_ENCODE(STM_PORT_G, 5)
#define PG6 STM_PIN_ENCODE(STM_PORT_G, 6)
#define PG7 STM_PIN_ENCODE(STM_PORT_G, 7)
#define PG8 STM_PIN_ENCODE(STM_PORT_G, 8)
#define PG9 STM_PIN_ENCODE(STM_PORT_G, 9)
#define PG10 STM_PIN_ENCODE(STM_PORT_G, 10)
#define PG11 STM_PIN_ENCODE(STM_PORT_G, 11)
#define PG12 STM_PIN_ENCODE(STM_PORT_G, 12)
#define PG13 STM_PIN_ENCODE(STM_PORT_G, 13)
#define PG14 STM_PIN_ENCODE(STM_PORT_G, 14)
#define PG15 STM_PIN_ENCODE(STM_PORT_G, 15)

/* Port H */
#define PH0 STM_PIN_ENCODE(STM_PORT_H, 0)
#define PH1 STM_PIN_ENCODE(STM_PORT_H, 1)
#define PH2 STM_PIN_ENCODE(STM_PORT_H, 2)
#define PH3 STM_PIN_ENCODE(STM_PORT_H, 3)
#define PH4 STM_PIN_ENCODE(STM_PORT_H, 4)
#define PH5 STM_PIN_ENCODE(STM_PORT_H, 5)
#define PH6 STM_PIN_ENCODE(STM_PORT_H, 6)
#define PH7 STM_PIN_ENCODE(STM_PORT_H, 7)
#define PH8 STM_PIN_ENCODE(STM_PORT_H, 8)
#define PH9 STM_PIN_ENCODE(STM_PORT_H, 9)
#define PH10 STM_PIN_ENCODE(STM_PORT_H, 10)
#define PH11 STM_PIN_ENCODE(STM_PORT_H, 11)
#define PH12 STM_PIN_ENCODE(STM_PORT_H, 12)
#define PH13 STM_PIN_ENCODE(STM_PORT_H, 13)
#define PH14 STM_PIN_ENCODE(STM_PORT_H, 14)
#define PH15 STM_PIN_ENCODE(STM_PORT_H, 15)

/* Port I */
#define PI0 STM_PIN_ENCODE(STM_PORT_I, 0)
#define PI1 STM_PIN_ENCODE(STM_PORT_I, 1)
#define PI2 STM_PIN_ENCODE(STM_PORT_I, 2)
#define PI3 STM_PIN_ENCODE(STM_PORT_I, 3)
#define PI4 STM_PIN_ENCODE(STM_PORT_I, 4)
#define PI5 STM_PIN_ENCODE(STM_PORT_I, 5)
#define PI6 STM_PIN_ENCODE(STM_PORT_I, 6)
#define PI7 STM_PIN_ENCODE(STM_PORT_I, 7)
#define PI8 STM_PIN_ENCODE(STM_PORT_I, 8)
#define PI9 STM_PIN_ENCODE(STM_PORT_I, 9)
#define PI10 STM_PIN_ENCODE(STM_PORT_I, 10)
#define PI11 STM_PIN_ENCODE(STM_PORT_I, 11)
#define PI12 STM_PIN_ENCODE(STM_PORT_I, 12)
#define PI13 STM_PIN_ENCODE(STM_PORT_I, 13)
#define PI14 STM_PIN_ENCODE(STM_PORT_I, 14)
#define PI15 STM_PIN_ENCODE(STM_PORT_I, 15)

/* Port J */
#define PJ0 STM_PIN_ENCODE(STM_PORT_J, 0)
#define PJ1 STM_PIN_ENCODE(STM_PORT_J, 1)
#define PJ2 STM_PIN_ENCODE(STM_PORT_J, 2)
#define PJ3 STM_PIN_ENCODE(STM_PORT_J, 3)
#define PJ4 STM_PIN_ENCODE(STM_PORT_J, 4)
#define PJ5 STM_PIN_ENCODE(STM_PORT_J, 5)
#define PJ6 STM_PIN_ENCODE(STM_PORT_J, 6)
#define PJ7 STM_PIN_ENCODE(STM_PORT_J, 7)
#define PJ8 STM_PIN_ENCODE(STM_PORT_J, 8)
#define PJ9 STM_PIN_ENCODE(STM_PORT_J, 9)
#define PJ10 STM_PIN_ENCODE(STM_PORT_J, 10)
#define PJ11 STM_PIN_ENCODE(STM_PORT_J, 11)
#define PJ12 STM_PIN_ENCODE(STM_PORT_J, 12)
#define PJ13 STM_PIN_ENCODE(STM_PORT_J, 13)
#define PJ14 STM_PIN_ENCODE(STM_PORT_J, 14)
#define PJ15 STM_PIN_ENCODE(STM_PORT_J, 15)

/* Port K */
#define PK0 STM_PIN_ENCODE(STM_PORT_K, 0)
#define PK1 STM_PIN_ENCODE(STM_PORT_K, 1)
#define PK2 STM_PIN_ENCODE(STM_PORT_K, 2)
#define PK3 STM_PIN_ENCODE(STM_PORT_K, 3)
#define PK4 STM_PIN_ENCODE(STM_PORT_K, 4)
#define PK5 STM_PIN_ENCODE(STM_PORT_K, 5)
#define PK6 STM_PIN_ENCODE(STM_PORT_K, 6)
#define PK7 STM_PIN_ENCODE(STM_PORT_K, 7)
#define PK8 STM_PIN_ENCODE(STM_PORT_K, 8)
#define PK9 STM_PIN_ENCODE(STM_PORT_K, 9)
#define PK10 STM_PIN_ENCODE(STM_PORT_K, 10)
#define PK11 STM_PIN_ENCODE(STM_PORT_K, 11)
#define PK12 STM_PIN_ENCODE(STM_PORT_K, 12)
#define PK13 STM_PIN_ENCODE(STM_PORT_K, 13)
#define PK14 STM_PIN_ENCODE(STM_PORT_K, 14)
#define PK15 STM_PIN_ENCODE(STM_PORT_K, 15)

#endif // ARDUINO_PIN_DEFS_H